modules/account/domain/README.md
```mermaid
graph TD
accountdomain["account:domain"]
accountmodel["account:model"]
apiactual["api:actual"]
budgetmodel["budget:model"]
codegenannotation["codegen:annotation"]
coremodel["core:model"]
logging["logging"]
prefs["prefs"]
style accountdomain fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style accountmodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style apiactual fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style budgetmodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style codegenannotation fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style coremodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style logging fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style prefs fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
accountdomain --> accountmodel
accountdomain -.-> apiactual
accountdomain -.-> logging
accountdomain -.-> prefs
apiactual --> accountmodel
apiactual --> budgetmodel
apiactual -.-> codegenannotation
apiactual --> coremodel
prefs --> accountmodel
prefs --> coremodel
```
