modules/account/domain/modules.dot
digraph {
edge ["dir"="forward"]
graph ["dpi"="100","fontsize"="30","ranksep"="1.5","rankdir"="TB"]
node ["style"="filled"]
":account:domain" ["fillcolor"="#9D8DF1","color"="black","penwidth"="3","shape"="box"]
":api:actual" ["fillcolor"="#9D8DF1","shape"="none"]
":budget:model" ["fillcolor"="#9D8DF1","shape"="none"]
":codegen:annotation" ["fillcolor"="#9D8DF1","shape"="none"]
":core:model" ["fillcolor"="#9D8DF1","shape"="none"]
":logging" ["fillcolor"="#9D8DF1","shape"="none"]
":prefs" ["fillcolor"="#9D8DF1","shape"="none"]
":account:domain" -> ":api:actual" ["style"="dotted"]
":account:domain" -> ":core:model"
":account:domain" -> ":logging" ["style"="dotted"]
":account:domain" -> ":prefs" ["style"="dotted"]
":api:actual" -> ":budget:model"
":api:actual" -> ":codegen:annotation" ["style"="dotted"]
":api:actual" -> ":core:model"
":prefs" -> ":core:model"
}
